ProgessBase/Documents/ПРГКорректировкаПереходящихОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГКорректировкаПереходящихОтгрузок</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладахМеждународныйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ис_ПродажиКорректировкиПродукцииМеждународныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
				<xr:Item>AccumulationRegister.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГВидыОперацийПереходящихОтгрузок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ПартииТоваровНаСкладахМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладахМеждународныйУчет</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Регламентный документ, сформировавший движения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСписанныхТоваров</Name>
					<Comment>Индекс строки списанных товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПереданныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеМатериаловИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ис_ПродажиКорректировкиПродукцииМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ис_ПродажиКорректировкиПродукцииМеждународныйУчет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезДопСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПРГАдресПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ис_СредневзвешеннаяСебестоимостьМеждународныйУчет</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Enums/ПРГВидыОперацийПереходящихОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПРГВидыОперацийПереходящихОтгрузок</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаСПереходомПраваСобственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПРГКорректировкаПереходящихОтгрузок/Ext/ObjectModule.bsl
Перем мУдалятьДвижения Экспорт;
Перем ПериодРегистрации Экспорт;

// Таблицы движений по регистрам
Перем мТаблицаДвиженийПартии;			 // По регистру партии товаров на складе
Перем мТаблицаДвиженийКорректировкиПродаж;			 // По регистру ..
Перем мТаблицаДвиженийСредСебестоимость;			 // По регистру ..

// Наборы движений по регистрам
Перем мДвиженияПартии;			         // По регистру партии товаров на складе
Перем мКорректировкиПродаж;
Перем мСредСебестоимость;
Перем мОперация;                         // По регистру бухгалтерии "Международный"
Перем мСуффиксИмениРегистра;             // Суффикс имени регистра. для бух. учета = "БухгалтерскийУчет"
								         // для упр. учета = "", для налог. учете = "НалоговыйУчет"
Перем мСуффиксСчета;                     // Суффикс счета. для бух. учета = "СчетУчетаБУ"
								         // для нал. учета = "СчетУчетаНУ"
#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Получить экземпляр документа на печать
	//Если ИмяМакета = "Информация" Тогда
		//ТабДокумент = ПечатьИнформации();
	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
	
КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктПечатныхФорм = Новый Структура;
	//СтруктПечатныхФорм.Вставить("Информация",          "Информация о переходящих отгрузках");
	
	Возврат СтруктПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если Не ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ПериодРегистрации = НачалоМесяца(Дата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, "Продажа", ОбъектКопирования.Ссылка);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПроверкаРеквизитов(Отказ, Заголовок, СтруктураШапкиДокумента);
	
	СтруктураТаблицДвижений = ПолучитьСтруктуруТаблицДвиженийРегистров(СтруктураШапкиДокумента);
	
	// Добавим дополнительные поля в структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(
		СтруктураШапкиДокумента,
		Отказ, 
		Заголовок
		);
		
	СформироватьТаблицыДвижений(СтруктураШапкиДокумента,СтруктураТаблицДвижений);	
		
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, СтруктураТаблицДвижений, Отказ, Заголовок);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверкаРеквизитов(Отказ, Заголовок, СтруктураШапкиДокумента) Экспорт
	
	//Проверить что документ за данный период с видом операции только 1
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРГКорректировкаПереходящихОтгрузок.Ссылка,
		|	ПРГКорректировкаПереходящихОтгрузок.Представление
		|ИЗ
		|	Документ.ПРГКорректировкаПереходящихОтгрузок КАК ПРГКорректировкаПереходящихОтгрузок
		|ГДЕ
		|	ПРГКорректировкаПереходящихОтгрузок.НачПериода = &НачПериода
		|	И ПРГКорректировкаПереходящихОтгрузок.КонПериода = &КонПериода
		|	И НЕ ПРГКорректировкаПереходящихОтгрузок.Ссылка = &Ссылка
		|	И ПРГКорректировкаПереходящихОтгрузок.Проведен = ИСТИНА
		|	И ПРГКорректировкаПереходящихОтгрузок.ВидОперации = &ВидОперации";

	Запрос.УстановитьПараметр("КонПериода", КонПериода);
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		СтрокаСообщения = "За данный период уже есть документ корректиовки: "+Выборка.Представление;
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);	
	
	КонецЕсли; 
		
КонецПроцедуры // ПроверкаРеквизитов()

// Функция формирует структуру таблиц движений регистров.
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости"
//
// Возвращаемое значение:
//   Структура – Структура таблиц движений регистров
//
Функция ПолучитьСтруктуруТаблицДвиженийРегистров(
	СтруктураШапкиДокумента
	)
	
	// Наборы движений по регистрам
	мСуффиксИмениРегистра      = "МеждународныйУчет";
	
	мДвиженияПартии			   = Движения.ПартииТоваровНаСкладахМеждународныйУчет;
	мКорректировкиПродаж	   = Движения.ис_ПродажиКорректировкиПродукцииМеждународныйУчет;
	мСредСебестоимость		   = Движения.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет;
	мОперация                  = Движения.Международный;
	мСуффиксСчета              = "СчетУчетаМСФО";
	
	мТаблицаДвиженийПартии				= мДвиженияПартии.Выгрузить();
	мТаблицаДвиженийКорректировкиПродаж = мКорректировкиПродаж.Выгрузить();
	мТаблицаДвиженийСредСебестоимость	= мСредСебестоимость.Выгрузить();
	
	//Добавим колонки мТаблицаДвиженийПартии
	мТаблицаДвиженийПартии.Колонки.Добавить("НоменклатурнаяГруппа",Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));

	//Добавим колонки мТаблицаДвиженийКорректировкиПродаж
	мТаблицаДвиженийКорректировкиПродаж.Колонки.Добавить("НоменклатурнаяГруппа",Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	мТаблицаДвиженийКорректировкиПродаж.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
    мТаблицаДвиженийКорректировкиПродаж.Колонки.Добавить("СчетДт");
	мТаблицаДвиженийКорректировкиПродаж.Колонки.Добавить("СчетКт");
	
	СтруктураТаблицДвижений = Новый Структура;
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийПартии", 				мТаблицаДвиженийПартии);
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийКорректировкиПродаж",  мТаблицаДвиженийКорректировкиПродаж);
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийСредСебестоимость", 	мТаблицаДвиженийСредСебестоимость);
	
	Возврат СтруктураТаблицДвижений;
	
КонецФункции // ПолучитьСтруктуруТаблицДвиженийРегистров()

// Процедура формирует структуру шапки документа и дополнительных полей.
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости"
//	Отказ - Булево - Признак отказа от проведения документа
//	Заголовок - Строка - Текст представления документа 
//
//
Процедура ПодготовитьСтруктуруШапкиДокумента(
	СтруктураШапкиДокумента, 
	Отказ, 
	Заголовок
	)  Экспорт
	
	// Период построения запросов
	мНачГраница = Новый Граница( НачалоМесяца(ПериодРегистрации), ВидГраницы.Включая);
	мКонГраница = Новый Граница( КонецМесяца(ПериодРегистрации), ВидГраницы.Включая);
	мНачДата    = НачалоМесяца(ПериодРегистрации);
	мКонДата    = КонецМесяца(ПериодРегистрации);

	СтруктураШапкиДокумента.Вставить("ОтражатьВМеждународномУчете",  Истина);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, СтруктураТаблицДвижений, Отказ, Заголовок)

	ДвиженияПоРегиструПартийТоваровНаСкладахМеж(РежимПроведения, СтруктураШапкиДокумента, Отказ);	
    ДвиженияПоРегиструСредСебестоимость(РежимПроведения, СтруктураШапкиДокумента, Отказ);
	ДвиженияПоРегиструПродажиКорректировкиПродукцииМеж(РежимПроведения, СтруктураШапкиДокумента, Отказ);
	ДвиженияПоРегиструМеждународный(РежимПроведения, СтруктураШапкиДокумента, Отказ);
	
КонецПроцедуры  //ДвиженияПоРегистрам()

// Формируем движения по регистру ПартииТоваровНаСкладахМеждународныйУчет
//
Процедура ДвиженияПоРегиструПартийТоваровНаСкладахМеж(РежимПроведения, СтруктураШапкиДокумента, Отказ)

	Если мТаблицаДвиженийПартии.Количество()=0 Тогда Возврат; КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладахМеждународныйУчет.
	Если Не Отказ Тогда
	
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("мТаблицаДвижений", мТаблицаДвиженийПартии);
				
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(мДвиженияПартии, СтруктТаблицДокумента);
					
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация", Организация);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Качество",    Справочники.Качество.Новый);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", Неопределено);
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(мДвиженияПартии, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);

	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегиструПартийТоваров()

// Формируем движения по регистру ис_СредневзвешеннаяСебестоимостьМеждународныйУчет
//
Процедура ДвиженияПоРегиструСредСебестоимость(РежимПроведения, СтруктураШапкиДокумента, Отказ)

	Если мТаблицаДвиженийСредСебестоимость.Количество()=0 Тогда Возврат; КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.
	Если Не Отказ Тогда
	
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("мТаблицаДвижений", мТаблицаДвиженийСредСебестоимость);
				
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(мСредСебестоимость, СтруктТаблицДокумента);
					
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация", Организация);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ВидДвижения", ВидДвиженияНакопления.Расход);
		
		Для каждого Стр Из ТаблицыДанныхДокумента.мТаблицаДвижений Цикл
			Движение = мСредСебестоимость.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Движение,Стр);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегиструСредСебестоимость()

// Формируем движения по регистру ис_ПродажиКорректировкиПродукцииМеждународныйУчет
//
Процедура ДвиженияПоРегиструПродажиКорректировкиПродукцииМеж(РежимПроведения, СтруктураШапкиДокумента, Отказ)

	Если мТаблицаДвиженийКорректировкиПродаж.Количество()=0 Тогда Возврат; КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ис_ПродажиКорректировкиПродукцииМеждународныйУчет.
	Если Не Отказ Тогда
	
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("мТаблицаДвижений", мТаблицаДвиженийКорректировкиПродаж);
				
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(мКорректировкиПродаж, СтруктТаблицДокумента);
					
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация", Организация);
		
		Для каждого Стр Из ТаблицыДанныхДокумента.мТаблицаДвижений Цикл
			Движение = мКорректировкиПродаж.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,Стр);            
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегиструСредСебестоимость()

// Формируем движения по регистру бухгалтерии Международный
//
Процедура ДвиженияПоРегиструМеждународный(РежимПроведения, СтруктураШапкиДокумента, Отказ)

	//Взаиморасчеты
	тТаблицаДвиженийВзаиморасчетыМеж = мТаблицаДвиженийКорректировкиПродаж.Скопировать(,"Контрагент,ДоговорКонтрагента,НоменклатурнаяГруппа,СтавкаНДС,Стоимость,НДС,СчетДт,СчетКт");
	тТаблицаДвиженийВзаиморасчетыМеж.Свернуть("Контрагент,ДоговорКонтрагента,НоменклатурнаяГруппа,СтавкаНДС,СчетДт,СчетКт","Стоимость,НДС");
	
	Для каждого СтрокаТЧ из тТаблицаДвиженийВзаиморасчетыМеж Цикл
		
		Проводка = мОперация.Добавить();
		Проводка.Период                   = СтруктураШапкиДокумента.Дата;
		Проводка.Организация              = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание 			  = ?(ВидОперации=Перечисления.ПРГВидыОперацийПереходящихОтгрузок.ОтгрузкаБезПереходаПраваСобственности,"Реализация без перехода права собственности","Реализация");
		
		Проводка.СчетДт                   = СтрокаТЧ.СчетДт;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаТЧ.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", СтрокаТЧ.ДоговорКонтрагента);
		
		Проводка.СчетКт 			  = СтрокаТЧ.СчетКт;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеГруппы", СтрокаТЧ.НоменклатурнаяГруппа);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС", СтрокаТЧ.СтавкаНДС);
		
		Проводка.Сумма                    = СтрокаТЧ.Стоимость-СтрокаТЧ.НДС; //Сумма без НДС
		
	КонецЦикла;

	//Себестоимость
	Для каждого СтрокаТЧ из мТаблицаДвиженийПартии Цикл
		
		Проводка = мОперация.Добавить();
		Проводка.Период                   = СтруктураШапкиДокумента.Дата;
		Проводка.Организация              = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание 			  = ?(ВидОперации=Перечисления.ПРГВидыОперацийПереходящихОтгрузок.ОтгрузкаБезПереходаПраваСобственности,"Реализация без перехода права собственности","Реализация");
		
		Проводка.СчетДт                   = СтрокаТЧ.КорСчет;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТЧ.НоменклатурнаяГруппа);
		
		Проводка.СчетКт 			  = СтрокаТЧ.СчетУчета;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", СтрокаТЧ.Номенклатура);
		
		Проводка.Сумма                    = СтрокаТЧ.Стоимость; //Сумма без НДС
		Проводка.КоличествоКт             = СтрокаТЧ.Количество; 

	КонецЦикла;
	
КонецПроцедуры //ДвиженияПоРегиструМеждународный()

Процедура СформироватьТаблицыДвижений(СтруктураШапкиДокумента,СтруктураТаблицДвижений)

	//>>310516 Степанов удалены старые варианты запроса
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(РасчетыПоРеализацииОрганизации.Регистратор КАК Документ.РеализацияТоваровУслуг) КАК Регистратор
	|ПОМЕСТИТЬ втРеализации
	|ИЗ
	|	РегистрСведений.РасчетыПоРеализацииОрганизации КАК РасчетыПоРеализацииОрганизации
	|ГДЕ
	|	РасчетыПоРеализацииОрганизации.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И РасчетыПоРеализацииОрганизации.Регистратор В
	|			(ВЫБРАТЬ
	|				ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи КАК ДокументПродажи
	|			ИЗ
	|				Документ.ПРГИнформацияОПереходящихОтгрузках.ПереходящиеОтгрузки КАК ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки
	|			ГДЕ
	|				ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Проведен = ИСТИНА
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.ВидОперации = &ВидОперации
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
	|			СГРУППИРОВАТЬ ПО
	|						ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоРеализацииОрганизации.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи.ДокументОснование КАК Документ.РеализацияТоваровУслуг) КАК Регистратор
	|ПОМЕСТИТЬ ВтРеализацииСторно
	|ИЗ
	|	Документ.ПРГИнформацияОПереходящихОтгрузках.ПереходящиеОтгрузки КАК ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки
	|ГДЕ
	|	ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Проведен = ИСТИНА
	|	И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.ВидОперации = &ВидОперации
	|	И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи ССЫЛКА Документ.ПРГ_СторноНакладной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоРеализацииОрганизации.Период,
	|	ВЫРАЗИТЬ(РасчетыПоРеализацииОрганизации.Регистратор КАК Документ.КорректировкаРеализации) КАК ДокументПродажи,
	|	РасчетыПоРеализацииОрганизации.Организация,
	|	РасчетыПоРеализацииОрганизации.Контрагент,
	|	РасчетыПоРеализацииОрганизации.ДоговорКонтрагента,
	|	РасчетыПоРеализацииОрганизации.СуммаВзаиморасчетов,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто1 КАК НоменклатурнаяГруппа,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто2 КАК СтавкаНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС - РасчетыПоРеализацииОрганизации.СуммаНДС КАК СуммаБезНДС,
	|	РасчетыПоРеализацииОрганизации.Номенклатура,
	|	СУММА(КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения) КАК Количество,
	|	РасчетыПоРеализацииОрганизации.Сделка КАК ЗаказПокупателя,
	|	КорректировкаРеализацииТовары.Ссылка.Грузополучатель КАК ПРГАдресПоставки,
	|	КорректировкаРеализацииТовары.СчетУчетаБУ,
	|	КорректировкаРеализацииТовары.СчетРасходовБУ,
	|	КорректировкаРеализацииТовары.СчетДоходовБУ,
	|	РасчетыПоРеализацииОрганизации.СчетОплаты КАК СчетУчетаРасчетовСКонтрагентом,
	|	ВложенныйЗапрос.СтоимостьБезДопСкидки,
	|	ВложенныйЗапрос.СтоимостьБезСкидок
	|ПОМЕСТИТЬ втКорректировки
	|ИЗ
	|	РегистрСведений.РасчетыПоРеализацииОрганизации КАК РасчетыПоРеализацииОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|		ПО РасчетыПоРеализацииОрганизации.Регистратор = КорректировкаРеализацииТовары.Ссылка
	|			И РасчетыПоРеализацииОрганизации.Номенклатура = КорректировкаРеализацииТовары.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Продажи.Регистратор КАК Регистратор,
	|			Продажи.ДокументПродажи КАК ДокументПродажи,
	|			СУММА(Продажи.Количество) КАК Количество,
	|			СУММА(Продажи.Стоимость) КАК Стоимость,
	|			СУММА(Продажи.СтоимостьБезСкидок) КАК СтоимостьБезСкидок,
	|			СУММА(Продажи.НДС) КАК НДС,
	|			СУММА(Продажи.СтоимостьБезДопСкидки) КАК СтоимостьБезДопСкидки,
	|			Продажи.Номенклатура КАК Номенклатура
	|		ИЗ
	|			РегистрНакопления.Продажи КАК Продажи
	|		ГДЕ
	|			Продажи.ДокументПродажи В
	|					(ВЫБРАТЬ
	|						ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи КАК ДокументПродажи
	|					ИЗ
	|						Документ.ПРГИнформацияОПереходящихОтгрузках.ПереходящиеОтгрузки КАК ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки
	|					ГДЕ
	|						ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|						И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Проведен = ИСТИНА
	|						И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.ВидОперации = &ВидОперации
	|						И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи ССЫЛКА Документ.КорректировкаРеализации
	|					СГРУППИРОВАТЬ ПО
	|								ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи)
	|			И Продажи.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Продажи.Регистратор,
	|			Продажи.ДокументПродажи,
	|			Продажи.Номенклатура) КАК ВложенныйЗапрос
	|		ПО РасчетыПоРеализацииОрганизации.Регистратор = ВложенныйЗапрос.Регистратор
	|			И РасчетыПоРеализацииОрганизации.Номенклатура = ВложенныйЗапрос.Номенклатура
	|ГДЕ
	|	РасчетыПоРеализацииОрганизации.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|	И РасчетыПоРеализацииОрганизации.Регистратор В
	|			(ВЫБРАТЬ
	|				ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи КАК ДокументПродажи
	|			ИЗ
	|				Документ.ПРГИнформацияОПереходящихОтгрузках.ПереходящиеОтгрузки КАК ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки
	|			ГДЕ
	|				ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Проведен = ИСТИНА
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.ВидОперации = &ВидОперации
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи ССЫЛКА Документ.КорректировкаРеализации
	|			СГРУППИРОВАТЬ ПО
	|						ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоРеализацииОрганизации.Регистратор,
	|	РасчетыПоРеализацииОрганизации.Период,
	|	РасчетыПоРеализацииОрганизации.Организация,
	|	РасчетыПоРеализацииОрганизации.Контрагент,
	|	РасчетыПоРеализацииОрганизации.ДоговорКонтрагента,
	|	РасчетыПоРеализацииОрганизации.СуммаВзаиморасчетов,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто1,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто2,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	РасчетыПоРеализацииОрганизации.Номенклатура,
	|	РасчетыПоРеализацииОрганизации.Сделка,
	|	КорректировкаРеализацииТовары.Ссылка.Грузополучатель,
	|	КорректировкаРеализацииТовары.СчетУчетаБУ,
	|	КорректировкаРеализацииТовары.СчетРасходовБУ,
	|	КорректировкаРеализацииТовары.СчетДоходовБУ,
	|	РасчетыПоРеализацииОрганизации.СчетОплаты,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС - РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	ВЫРАЗИТЬ(РасчетыПоРеализацииОрганизации.Регистратор КАК Документ.КорректировкаРеализации),
	|	ВложенныйЗапрос.СтоимостьБезДопСкидки,
	|	ВложенныйЗапрос.СтоимостьБезСкидок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоРеализацииОрганизации.Период,
	|	ВЫРАЗИТЬ(РасчетыПоРеализацииОрганизации.Регистратор КАК Документ.ВозвратТоваровОтПокупателя) КАК ДокументПродажи,
	|	РасчетыПоРеализацииОрганизации.Организация,
	|	РасчетыПоРеализацииОрганизации.Контрагент,
	|	РасчетыПоРеализацииОрганизации.ДоговорКонтрагента,
	|	-РасчетыПоРеализацииОрганизации.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто1 КАК НоменклатурнаяГруппа,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто2 КАК СтавкаНДС,
	|	-РасчетыПоРеализацииОрганизации.СуммаСНДС КАК СуммаСНДС,
	|	-РасчетыПоРеализацииОрганизации.СуммаНДС КАК СуммаНДС,
	|	-(РасчетыПоРеализацииОрганизации.СуммаСНДС - РасчетыПоРеализацииОрганизации.СуммаНДС) КАК СуммаБезНДС,
	|	РасчетыПоРеализацииОрганизации.Номенклатура,
	|	-СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество,
	|	РасчетыПоРеализацииОрганизации.Сделка КАК ЗаказПокупателя,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Грузополучатель КАК ПРГАдресПоставки,
	|	ВозвратТоваровОтПокупателяТовары.СчетУчетаБУ,
	|	ВозвратТоваровОтПокупателяТовары.СчетРасходовБУ,
	|	ВозвратТоваровОтПокупателяТовары.СчетДоходовБУ,
	|	РасчетыПоРеализацииОрганизации.СчетОплаты КАК СчетУчетаРасчетовСКонтрагентом,
	|	Продажи.СтоимостьБезДопСкидки,
	|	Продажи.СтоимостьБезСкидок
	|ПОМЕСТИТЬ втВозвратыТоваровОтПокупателя
	|ИЗ
	|	РегистрСведений.РасчетыПоРеализацииОрганизации КАК РасчетыПоРеализацииОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ПО РасчетыПоРеализацииОрганизации.Регистратор = ВозвратТоваровОтПокупателяТовары.Ссылка
	|			И РасчетыПоРеализацииОрганизации.Номенклатура = ВозвратТоваровОтПокупателяТовары.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|		ПО РасчетыПоРеализацииОрганизации.Регистратор = Продажи.Регистратор
	|			И РасчетыПоРеализацииОрганизации.Номенклатура = Продажи.Номенклатура
	|ГДЕ
	|	РасчетыПоРеализацииОрганизации.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|	И РасчетыПоРеализацииОрганизации.Регистратор В
	|			(ВЫБРАТЬ
	|				ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи КАК ДокументПродажи
	|			ИЗ
	|				Документ.ПРГИнформацияОПереходящихОтгрузках.ПереходящиеОтгрузки КАК ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки
	|			ГДЕ
	|				ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.Проведен = ИСТИНА
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.Ссылка.ВидОперации = &ВидОперации
	|				И ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|			СГРУППИРОВАТЬ ПО
	|						ПРГИнформацияОПереходящихОтгрузкахПереходящиеОтгрузки.ДокументПродажи)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоРеализацииОрганизации.Регистратор,
	|	РасчетыПоРеализацииОрганизации.Период,
	|	РасчетыПоРеализацииОрганизации.Организация,
	|	РасчетыПоРеализацииОрганизации.Контрагент,
	|	РасчетыПоРеализацииОрганизации.ДоговорКонтрагента,
	|	РасчетыПоРеализацииОрганизации.СуммаВзаиморасчетов,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто1,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто2,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	РасчетыПоРеализацииОрганизации.Номенклатура,
	|	РасчетыПоРеализацииОрганизации.Сделка,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Грузополучатель,
	|	ВозвратТоваровОтПокупателяТовары.СчетУчетаБУ,
	|	ВозвратТоваровОтПокупателяТовары.СчетРасходовБУ,
	|	ВозвратТоваровОтПокупателяТовары.СчетДоходовБУ,
	|	РасчетыПоРеализацииОрганизации.СчетОплаты,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС - РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	ВЫРАЗИТЬ(РасчетыПоРеализацииОрганизации.Регистратор КАК Документ.ВозвратТоваровОтПокупателя),
	|	Продажи.СтоимостьБезДопСкидки,
	|	Продажи.СтоимостьБезСкидок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализации.Регистратор,
	|	втРеализации.Регистратор КАК ДокументПродажи,
	|	РасчетыПоРеализацииОрганизации.Организация,
	|	РасчетыПоРеализацииОрганизации.Контрагент,
	|	РасчетыПоРеализацииОрганизации.ДоговорКонтрагента,
	|	РасчетыПоРеализацииОрганизации.СуммаВзаиморасчетов,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто1 КАК НоменклатурнаяГруппа,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто2 КАК СтавкаНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС - РасчетыПоРеализацииОрганизации.СуммаНДС КАК СуммаБезНДС,
	|	РасчетыПоРеализацииОрганизации.Номенклатура,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|	РасчетыПоРеализацииОрганизации.Период,
	|	втРеализации.Регистратор.Сделка КАК ЗаказПокупателя,
	|	втРеализации.Регистратор.Грузополучатель КАК ПРГАдресПоставки,
	|	РеализацияТоваровУслугТовары.СчетУчетаБУ,
	|	РеализацияТоваровУслугТовары.СчетРасходовБУ,
	|	РеализацияТоваровУслугТовары.СчетДоходовБУ,
	|	РеализацияТоваровУслугТовары.Ссылка.СчетУчетаРасчетовСКонтрагентом,
	|	Продажи.СтоимостьБезДопСкидки,
	|	Продажи.СтоимостьБезСкидок
	|ПОМЕСТИТЬ втРеализацииРегистр
	|ИЗ
	|	втРеализации КАК втРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетыПоРеализацииОрганизации КАК РасчетыПоРеализацииОрганизации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ПО РасчетыПоРеализацииОрганизации.Регистратор = РеализацияТоваровУслугТовары.Ссылка
	|				И РасчетыПоРеализацииОрганизации.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|			ПО РасчетыПоРеализацииОрганизации.Регистратор = Продажи.Регистратор
	|				И РасчетыПоРеализацииОрганизации.Номенклатура = Продажи.Номенклатура
	|		ПО втРеализации.Регистратор = РасчетыПоРеализацииОрганизации.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоРеализацииОрганизации.Организация,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто1,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто2,
	|	РасчетыПоРеализацииОрганизации.Номенклатура,
	|	РасчетыПоРеализацииОрганизации.Контрагент,
	|	РасчетыПоРеализацииОрганизации.ДоговорКонтрагента,
	|	втРеализации.Регистратор,
	|	РасчетыПоРеализацииОрганизации.СуммаВзаиморасчетов,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС - РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	РасчетыПоРеализацииОрганизации.Период,
	|	втРеализации.Регистратор.Сделка,
	|	втРеализации.Регистратор.Грузополучатель,
	|	РеализацияТоваровУслугТовары.СчетУчетаБУ,
	|	РеализацияТоваровУслугТовары.СчетРасходовБУ,
	|	РеализацияТоваровУслугТовары.СчетДоходовБУ,
	|	РеализацияТоваровУслугТовары.Ссылка.СчетУчетаРасчетовСКонтрагентом,
	|	Продажи.СтоимостьБезДопСкидки,
	|	Продажи.СтоимостьБезСкидок,
	|	втРеализации.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализацииСторно.Регистратор,
	|	втРеализацииСторно.Регистратор КАК ДокументПродажи,
	|	РасчетыПоРеализацииОрганизации.Организация,
	|	РасчетыПоРеализацииОрганизации.Контрагент,
	|	РасчетыПоРеализацииОрганизации.ДоговорКонтрагента,
	|	-РасчетыПоРеализацииОрганизации.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто1 КАК НоменклатурнаяГруппа,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто2 КАК СтавкаНДС,
	|	-РасчетыПоРеализацииОрганизации.СуммаСНДС КАК СуммаСНДС,
	|	-РасчетыПоРеализацииОрганизации.СуммаНДС КАК СуммаНДС,
	|	-(РасчетыПоРеализацииОрганизации.СуммаСНДС - РасчетыПоРеализацииОрганизации.СуммаНДС) КАК СуммаБезНДС,
	|	РасчетыПоРеализацииОрганизации.Номенклатура,
	|	-СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|	РасчетыПоРеализацииОрганизации.Период,
	|	втРеализацииСторно.Регистратор.Сделка КАК ЗаказПокупателя,
	|	втРеализацииСторно.Регистратор.Грузополучатель КАК ПРГАдресПоставки,
	|	РеализацияТоваровУслугТовары.СчетУчетаБУ,
	|	РеализацияТоваровУслугТовары.СчетРасходовБУ,
	|	РеализацияТоваровУслугТовары.СчетДоходовБУ,
	|	РеализацияТоваровУслугТовары.Ссылка.СчетУчетаРасчетовСКонтрагентом,
	|	Продажи.СтоимостьБезДопСкидки,
	|	Продажи.СтоимостьБезСкидок
	|ПОМЕСТИТЬ втРеализацииСторноРегистр
	|ИЗ
	|	ВтРеализацииСторно КАК втРеализацииСторно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетыПоРеализацииОрганизации КАК РасчетыПоРеализацииОрганизации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ПО РасчетыПоРеализацииОрганизации.Регистратор = РеализацияТоваровУслугТовары.Ссылка
	|				И РасчетыПоРеализацииОрганизации.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|			ПО РасчетыПоРеализацииОрганизации.Регистратор = Продажи.Регистратор
	|				И РасчетыПоРеализацииОрганизации.Номенклатура = Продажи.Номенклатура
	|		ПО втРеализацииСторно.Регистратор = РасчетыПоРеализацииОрганизации.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоРеализацииОрганизации.Организация,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто1,
	|	РасчетыПоРеализацииОрганизации.КоррСубконто2,
	|	РасчетыПоРеализацииОрганизации.Номенклатура,
	|	РасчетыПоРеализацииОрганизации.Контрагент,
	|	РасчетыПоРеализацииОрганизации.ДоговорКонтрагента,
	|	втРеализацииСторно.Регистратор,
	|	РасчетыПоРеализацииОрганизации.СуммаВзаиморасчетов,
	|	РасчетыПоРеализацииОрганизации.СуммаСНДС,
	|	РасчетыПоРеализацииОрганизации.СуммаНДС,
	|	-(РасчетыПоРеализацииОрганизации.СуммаСНДС - РасчетыПоРеализацииОрганизации.СуммаНДС),
	|	РасчетыПоРеализацииОрганизации.Период,
	|	втРеализацииСторно.Регистратор.Сделка,
	|	втРеализацииСторно.Регистратор.Грузополучатель,
	|	РеализацияТоваровУслугТовары.СчетУчетаБУ,
	|	РеализацияТоваровУслугТовары.СчетРасходовБУ,
	|	РеализацияТоваровУслугТовары.СчетДоходовБУ,
	|	РеализацияТоваровУслугТовары.Ссылка.СчетУчетаРасчетовСКонтрагентом,
	|	Продажи.СтоимостьБезДопСкидки,
	|	Продажи.СтоимостьБезСкидок,
	|	втРеализацииСторно.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА втРеализацииРегистр.Период > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ втРеализацииРегистр.Период
	|	КОНЕЦ КАК Период,
	|	втРеализацииРегистр.ДокументПродажи,
	|	втРеализацииРегистр.Организация,
	|	втРеализацииРегистр.Контрагент,
	|	втРеализацииРегистр.ДоговорКонтрагента,
	|	СУММА(втРеализацииРегистр.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	втРеализацииРегистр.НоменклатурнаяГруппа,
	|	втРеализацииРегистр.СтавкаНДС,
	|	СУММА(втРеализацииРегистр.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(втРеализацииРегистр.СуммаНДС) КАК СуммаНДС,
	|	СУММА(втРеализацииРегистр.СуммаБезНДС) КАК СуммаБезНДС,
	|	втРеализацииРегистр.Номенклатура,
	|	СУММА(втРеализацииРегистр.Количество) КАК Количество,
	|	втРеализацииРегистр.ЗаказПокупателя,
	|	втРеализацииРегистр.ПРГАдресПоставки,
	|	втРеализацииРегистр.СчетУчетаБУ,
	|	втРеализацииРегистр.СчетРасходовБУ,
	|	втРеализацииРегистр.СчетДоходовБУ,
	|	втРеализацииРегистр.СчетУчетаРасчетовСКонтрагентом,
	|	СУММА(втРеализацииРегистр.СтоимостьБезДопСкидки) КАК СтоимостьБезДопСкидки,
	|	СУММА(втРеализацииРегистр.СтоимостьБезСкидок) КАК СтоимостьБезСкидок
	|ПОМЕСТИТЬ втРеализацииОстатки
	|ИЗ
	|	втРеализацииРегистр КАК втРеализацииРегистр
	|
	|СГРУППИРОВАТЬ ПО
	|	втРеализацииРегистр.ДокументПродажи,
	|	втРеализацииРегистр.Организация,
	|	втРеализацииРегистр.Контрагент,
	|	втРеализацииРегистр.ДоговорКонтрагента,
	|	втРеализацииРегистр.НоменклатурнаяГруппа,
	|	втРеализацииРегистр.СтавкаНДС,
	|	втРеализацииРегистр.Номенклатура,
	|	втРеализацииРегистр.ЗаказПокупателя,
	|	втРеализацииРегистр.Период,
	|	втРеализацииРегистр.ПРГАдресПоставки,
	|	втРеализацииРегистр.СчетУчетаБУ,
	|	втРеализацииРегистр.СчетРасходовБУ,
	|	втРеализацииРегистр.СчетДоходовБУ,
	|	втРеализацииРегистр.СчетУчетаРасчетовСКонтрагентом
	|
	|ИМЕЮЩИЕ
	|	НЕ СУММА(втРеализацииРегистр.СуммаВзаиморасчетов) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА втВозвратыТоваровОтПокупателя.Период > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ втВозвратыТоваровОтПокупателя.Период
	|	КОНЕЦ,
	|	втВозвратыТоваровОтПокупателя.ДокументПродажи,
	|	втВозвратыТоваровОтПокупателя.Организация,
	|	втВозвратыТоваровОтПокупателя.Контрагент,
	|	втВозвратыТоваровОтПокупателя.ДоговорКонтрагента,
	|	СУММА(втВозвратыТоваровОтПокупателя.СуммаВзаиморасчетов),
	|	втВозвратыТоваровОтПокупателя.НоменклатурнаяГруппа,
	|	втВозвратыТоваровОтПокупателя.СтавкаНДС,
	|	СУММА(втВозвратыТоваровОтПокупателя.СуммаСНДС),
	|	СУММА(втВозвратыТоваровОтПокупателя.СуммаНДС),
	|	СУММА(втВозвратыТоваровОтПокупателя.СуммаБезНДС),
	|	втВозвратыТоваровОтПокупателя.Номенклатура,
	|	СУММА(втВозвратыТоваровОтПокупателя.Количество),
	|	втВозвратыТоваровОтПокупателя.ЗаказПокупателя,
	|	втВозвратыТоваровОтПокупателя.ПРГАдресПоставки,
	|	втВозвратыТоваровОтПокупателя.СчетУчетаБУ,
	|	втВозвратыТоваровОтПокупателя.СчетРасходовБУ,
	|	втВозвратыТоваровОтПокупателя.СчетДоходовБУ,
	|	втВозвратыТоваровОтПокупателя.СчетУчетаРасчетовСКонтрагентом,
	|	СУММА(втВозвратыТоваровОтПокупателя.СтоимостьБезДопСкидки),
	|	СУММА(втВозвратыТоваровОтПокупателя.СтоимостьБезСкидок)
	|ИЗ
	|	втВозвратыТоваровОтПокупателя КАК втВозвратыТоваровОтПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	втВозвратыТоваровОтПокупателя.ДокументПродажи,
	|	втВозвратыТоваровОтПокупателя.Организация,
	|	втВозвратыТоваровОтПокупателя.Контрагент,
	|	втВозвратыТоваровОтПокупателя.ДоговорКонтрагента,
	|	втВозвратыТоваровОтПокупателя.НоменклатурнаяГруппа,
	|	втВозвратыТоваровОтПокупателя.СтавкаНДС,
	|	втВозвратыТоваровОтПокупателя.Номенклатура,
	|	втВозвратыТоваровОтПокупателя.ЗаказПокупателя,
	|	втВозвратыТоваровОтПокупателя.Период,
	|	втВозвратыТоваровОтПокупателя.ПРГАдресПоставки,
	|	втВозвратыТоваровОтПокупателя.СчетУчетаБУ,
	|	втВозвратыТоваровОтПокупателя.СчетРасходовБУ,
	|	втВозвратыТоваровОтПокупателя.СчетДоходовБУ,
	|	втВозвратыТоваровОтПокупателя.СчетУчетаРасчетовСКонтрагентом
	|
	|ИМЕЮЩИЕ
	|	НЕ СУММА(втВозвратыТоваровОтПокупателя.СуммаВзаиморасчетов) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА втРеализацииСторноРегистр.Период > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ втРеализацииСторноРегистр.Период
	|	КОНЕЦ,
	|	втРеализацииСторноРегистр.ДокументПродажи,
	|	втРеализацииСторноРегистр.Организация,
	|	втРеализацииСторноРегистр.Контрагент,
	|	втРеализацииСторноРегистр.ДоговорКонтрагента,
	|	СУММА(втРеализацииСторноРегистр.СуммаВзаиморасчетов),
	|	втРеализацииСторноРегистр.НоменклатурнаяГруппа,
	|	втРеализацииСторноРегистр.СтавкаНДС,
	|	СУММА(втРеализацииСторноРегистр.СуммаСНДС),
	|	СУММА(втРеализацииСторноРегистр.СуммаНДС),
	|	СУММА(втРеализацииСторноРегистр.СуммаБезНДС),
	|	втРеализацииСторноРегистр.Номенклатура,
	|	СУММА(втРеализацииСторноРегистр.Количество),
	|	втРеализацииСторноРегистр.ЗаказПокупателя,
	|	втРеализацииСторноРегистр.ПРГАдресПоставки,
	|	втРеализацииСторноРегистр.СчетУчетаБУ,
	|	втРеализацииСторноРегистр.СчетРасходовБУ,
	|	втРеализацииСторноРегистр.СчетДоходовБУ,
	|	втРеализацииСторноРегистр.СчетУчетаРасчетовСКонтрагентом,
	|	СУММА(втРеализацииСторноРегистр.СтоимостьБезДопСкидки),
	|	СУММА(втРеализацииСторноРегистр.СтоимостьБезСкидок)
	|ИЗ
	|	втРеализацииСторноРегистр КАК втРеализацииСторноРегистр
	|
	|СГРУППИРОВАТЬ ПО
	|	втРеализацииСторноРегистр.ДокументПродажи,
	|	втРеализацииСторноРегистр.Организация,
	|	втРеализацииСторноРегистр.Контрагент,
	|	втРеализацииСторноРегистр.ДоговорКонтрагента,
	|	втРеализацииСторноРегистр.НоменклатурнаяГруппа,
	|	втРеализацииСторноРегистр.СтавкаНДС,
	|	втРеализацииСторноРегистр.Номенклатура,
	|	втРеализацииСторноРегистр.ЗаказПокупателя,
	|	втРеализацииСторноРегистр.Период,
	|	втРеализацииСторноРегистр.ПРГАдресПоставки,
	|	втРеализацииСторноРегистр.СчетУчетаБУ,
	|	втРеализацииСторноРегистр.СчетРасходовБУ,
	|	втРеализацииСторноРегистр.СчетДоходовБУ,
	|	втРеализацииСторноРегистр.СчетУчетаРасчетовСКонтрагентом
	|
	|ИМЕЮЩИЕ
	|	НЕ СУММА(втРеализацииСторноРегистр.СуммаВзаиморасчетов) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА втКорректировки.Период > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ втКорректировки.Период
	|	КОНЕЦ,
	|	втКорректировки.ДокументПродажи,
	|	втКорректировки.Организация,
	|	втКорректировки.Контрагент,
	|	втКорректировки.ДоговорКонтрагента,
	|	втКорректировки.СуммаВзаиморасчетов,
	|	втКорректировки.НоменклатурнаяГруппа,
	|	втКорректировки.СтавкаНДС,
	|	втКорректировки.СуммаСНДС,
	|	втКорректировки.СуммаНДС,
	|	втКорректировки.СуммаБезНДС,
	|	втКорректировки.Номенклатура,
	|	втКорректировки.Количество,
	|	втКорректировки.ЗаказПокупателя,
	|	втКорректировки.ПРГАдресПоставки,
	|	втКорректировки.СчетУчетаБУ,
	|	втКорректировки.СчетРасходовБУ,
	|	втКорректировки.СчетДоходовБУ,
	|	втКорректировки.СчетУчетаРасчетовСКонтрагентом,
	|	втКорректировки.СтоимостьБезДопСкидки,
	|	втКорректировки.СтоимостьБезСкидок
	|ИЗ
	|	втКорректировки КАК втКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Номенклатура,
	|	СУММА(ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.СтоимостьОборот) КАК СтоимостьОборот
	|ПОМЕСТИТЬ ВТ_КорректировкиПартий
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладахМеждународныйУчет.ОстаткиИОбороты(
	|			&НачалоКонцаПериода,
	|			&КонецПериода,
	|			Авто,
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					втРеализацииОстатки.Номенклатура КАК Номенклатура
	|				ИЗ
	|					втРеализацииОстатки КАК втРеализацииОстатки
	|				СГРУППИРОВАТЬ ПО
	|							втРеализацииОстатки.Номенклатура)) КАК ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты
	|ГДЕ
	|	ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПРГКорректировкаПереходящихОтгрузок
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Период,
	|	ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.КоличествоКонечныйОстаток - ЕСТЬNULL(ВТ_КорректировкиПартий.КоличествоОборот, 0) > 0
	|				И ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.СтоимостьКонечныйОстаток - ЕСТЬNULL(ВТ_КорректировкиПартий.СтоимостьОборот, 0) > 0
	|			ТОГДА (ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.СтоимостьКонечныйОстаток - ЕСТЬNULL(ВТ_КорректировкиПартий.СтоимостьОборот, 0)) / (ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.КоличествоКонечныйОстаток - ЕСТЬNULL(ВТ_КорректировкиПартий.КоличествоОборот, 0))
	|		КОГДА ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	|				И ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.СтоимостьНачальныйОстаток > 0
	|			ТОГДА ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.СтоимостьНачальныйОстаток / ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.КоличествоНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СебестоимостьПоПартиям,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.КоличествоКонечныйОстаток - ЕСТЬNULL(ВТ_КорректировкиПартий.КоличествоОборот, 0) > 0
	|			ТОГДА ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстаткиИОбороты.СуммаКонечныйОстаток
	|		КОГДА ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	|			ТОГДА ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстаткиИОбороты.СуммаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СебестоимостьПоРНСредСеб,
	|	ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстаткиИОбороты.СтатьяЗатрат
	|ПОМЕСТИТЬ втПартииМСФО
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладахМеждународныйУчет.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					втРеализацииОстатки.Номенклатура КАК Номенклатура
	|				ИЗ
	|					втРеализацииОстатки КАК втРеализацииОстатки
	|				СГРУППИРОВАТЬ ПО
	|							втРеализацииОстатки.Номенклатура)) КАК ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.ОстаткиИОбороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Месяц,
	|				,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						втРеализацииОстатки.Номенклатура КАК Номенклатура
	|					ИЗ
	|						втРеализацииОстатки КАК втРеализацииОстатки
	|					СГРУППИРОВАТЬ ПО
	|								втРеализацииОстатки.Номенклатура)) КАК ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстаткиИОбороты
	|		ПО ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Организация = ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстаткиИОбороты.Организация
	|			И ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Номенклатура = ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстаткиИОбороты.Номенклатура
	|			И ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.ХарактеристикаНоменклатуры = ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстаткиИОбороты.ХарактеристикаНоменклатуры
	|			И ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Период = ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстаткиИОбороты.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КорректировкиПартий КАК ВТ_КорректировкиПартий
	|		ПО ПартииТоваровНаСкладахМеждународныйУчетОстаткиИОбороты.Номенклатура = ВТ_КорректировкиПартий.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ССТ.Номенклатура,
	|	СУММА(ВТ_ССТ.СебестоимостьПоРНСредСеб) КАК СуммаИтог
	|ПОМЕСТИТЬ ВТ_ССТ_Номенклатура
	|ИЗ
	|	втПартииМСФО КАК ВТ_ССТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ССТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ССТ.Период,
	|	ВТ_ССТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_ССТ.СебестоимостьПоПартиям,
	|	ВТ_ССТ.СебестоимостьПоРНСредСеб,
	|	ВТ_ССТ.СтатьяЗатрат,
	|	ВТ_ССТ_Номенклатура.СуммаИтог,
	|	ВТ_ССТ.СебестоимостьПоРНСредСеб / ВТ_ССТ_Номенклатура.СуммаИтог КАК УдельныйВес
	|ПОМЕСТИТЬ ВТ_ССТ_УдельныеВеса
	|ИЗ
	|	ВТ_ССТ_Номенклатура КАК ВТ_ССТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПартииМСФО КАК ВТ_ССТ
	|		ПО ВТ_ССТ_Номенклатура.Номенклатура = ВТ_ССТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализацииОстатки.Период,
	|	ВЫБОР
	|		КОГДА втРеализацииОстатки.ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА втРеализацииОстатки.ДокументПродажи
	|		КОГДА втРеализацииОстатки.ДокументПродажи ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|			ТОГДА ВЫРАЗИТЬ(втРеализацииОстатки.ДокументПродажи.ДокументОснование КАК Документ.РеализацияТоваровУслуг)
	|		КОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации
	|		КОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации
	|					КОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
	|						ТОГДА ВЫБОР
	|								КОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации.ДокументРеализации ССЫЛКА Документ.РеализацияТоваровУслуг
	|									ТОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации.ДокументРеализации
	|								КОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации.ДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
	|									ТОГДА ВЫБОР
	|											КОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации.ДокументРеализации.ДокументРеализации ССЫЛКА Документ.РеализацияТоваровУслуг
	|												ТОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации.ДокументРеализации.ДокументРеализации
	|											КОГДА втРеализацииОстатки.ДокументПродажи.ДокументРеализации.ДокументРеализации.ДокументРеализации.ДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
	|												ТОГДА NULL
	|											ИНАЧЕ NULL
	|										КОНЕЦ
	|								ИНАЧЕ NULL
	|							КОНЕЦ
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ДокументПродажи,
	|	втРеализацииОстатки.Организация,
	|	втРеализацииОстатки.Контрагент,
	|	втРеализацииОстатки.ДоговорКонтрагента,
	|	втРеализацииОстатки.СуммаВзаиморасчетов,
	|	втРеализацииОстатки.НоменклатурнаяГруппа,
	|	втРеализацииОстатки.СтавкаНДС,
	|	втРеализацииОстатки.СуммаСНДС,
	|	втРеализацииОстатки.СуммаНДС,
	|	втРеализацииОстатки.СуммаБезНДС,
	|	втРеализацииОстатки.Номенклатура,
	|	втРеализацииОстатки.Количество,
	|	ЕСТЬNULL(ВТ_ССТ_УдельныеВеса.СебестоимостьПоПартиям, 0) КАК СебестоимостьПоПартиям,
	|	втРеализацииОстатки.ЗаказПокупателя,
	|	втРеализацииОстатки.ПРГАдресПоставки,
	|	втРеализацииОстатки.СчетУчетаБУ,
	|	СоответствиеСчБУиМСФО_СчетУчета.СчетМеждународный КАК СчетУчетаМСФО,
	|	втРеализацииОстатки.СчетРасходовБУ,
	|	СоответствиеСчБУиМСФО_СчетРасходов.СчетМеждународный КАК СчетРасходовМСФО,
	|	втРеализацииОстатки.СчетДоходовБУ,
	|	СоответствиеСчБУиМСФО_СчетДоходов.СчетМеждународный КАК СчетДоходовМСФО,
	|	втРеализацииОстатки.СчетУчетаРасчетовСКонтрагентом,
	|	СоответствиеСчБУиМСФО_СчетВзаиморасчетов.СчетМеждународный КАК СчетУчетаРасчетовСКонтрагентомМСФО,
	|	ВТ_ССТ_УдельныеВеса.СтатьяЗатрат,
	|	ЕСТЬNULL(ВТ_ССТ_УдельныеВеса.УдельныйВес, 0) КАК УдельныйВес,
	|	втРеализацииОстатки.СтоимостьБезДопСкидки,
	|	втРеализацииОстатки.СтоимостьБезСкидок
	|ИЗ
	|	втРеализацииОстатки КАК втРеализацииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ССТ_УдельныеВеса КАК ВТ_ССТ_УдельныеВеса
	|		ПО втРеализацииОстатки.Номенклатура = ВТ_ССТ_УдельныеВеса.Номенклатура
	|			И (НАЧАЛОПЕРИОДА(втРеализацииОстатки.Период, МЕСЯЦ) = ВТ_ССТ_УдельныеВеса.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовБУиМСФО.СрезПоследних(&Дата, ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит)) КАК СоответствиеСчБУиМСФО_СчетУчета
	|		ПО втРеализацииОстатки.СчетУчетаБУ = СоответствиеСчБУиМСФО_СчетУчета.СчетХозрасчетный
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовБУиМСФО.СрезПоследних(&Дата, ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет)) КАК СоответствиеСчБУиМСФО_СчетРасходов
	|		ПО втРеализацииОстатки.СчетРасходовБУ = СоответствиеСчБУиМСФО_СчетРасходов.СчетХозрасчетный
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовБУиМСФО.СрезПоследних(&Дата, ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит)) КАК СоответствиеСчБУиМСФО_СчетДоходов
	|		ПО втРеализацииОстатки.СчетДоходовБУ = СоответствиеСчБУиМСФО_СчетДоходов.СчетХозрасчетный
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовБУиМСФО.СрезПоследних КАК СоответствиеСчБУиМСФО_СчетВзаиморасчетов
	|		ПО втРеализацииОстатки.СчетУчетаРасчетовСКонтрагентом = СоответствиеСчБУиМСФО_СчетВзаиморасчетов.СчетХозрасчетный";
	
	
	Запрос.УстановитьПараметр("ВидОперации",  СтруктураШапкиДокумента.ВидОперации);
	Запрос.УстановитьПараметр("НачалоКонцаПериода",НачалоМесяца(СтруктураШапкиДокумента.КонПериода));
	Запрос.УстановитьПараметр("НачалоПериода",СтруктураШапкиДокумента.НачПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(СтруктураШапкиДокумента.КонПериода));
    Запрос.УстановитьПараметр("Дата", КонецДня(СтруктураШапкиДокумента.Дата));
	
	Результат = Запрос.Выполнить().Выгрузить();

	//>>300516 Степанов 
	РезультатДляДвиженийСрССТ = Результат.Скопировать();
	РезультатДляДвиженийСрССТ.Свернуть("Номенклатура,СтатьяЗатрат,УдельныйВес");
	//<<
	
	РезультатДляДвиженийПартии = Результат.Скопировать();
	//{20.02.2017 Островерхий заявка №57373 
	//РезультатДляДвиженийПартии.Свернуть("Период,ДокументПродажи,Организация,Контрагент,ДоговорКонтрагента,СуммаВзаиморасчетов,НоменклатурнаяГруппа,СтавкаНДС,СуммаСНДС,СуммаНДС,СуммаБезНДС,Номенклатура,Количество,СебестоимостьПоПартиям,ЗаказПокупателя,ПРГАдресПоставки
	//|,СчетУчетаМСФО,СчетРасходовМСФО,СчетДоходовМСФО,СчетУчетаРасчетовСКонтрагентомМСФО"); 
	РезультатДляДвиженийПартии.Свернуть("Период,ДокументПродажи,Организация,Контрагент,ДоговорКонтрагента,СуммаВзаиморасчетов,НоменклатурнаяГруппа,СтавкаНДС,СуммаСНДС,СуммаНДС,СуммаБезНДС,Номенклатура,Количество,СебестоимостьПоПартиям,ЗаказПокупателя,ПРГАдресПоставки
	|,СчетУчетаМСФО,СчетРасходовМСФО,СчетДоходовМСФО,СчетУчетаРасчетовСКонтрагентомМСФО,СтоимостьБезДопСкидки,СтоимостьБезСкидок");
	//20.02.2017 Островерхий} 
	
	//мТаблицаДвиженийПартии
	Для каждого СтрокаТЧ Из РезультатДляДвиженийПартии Цикл
	
		тНоваяСтрока = мТаблицаДвиженийПартии.Добавить();	
		тНоваяСтрока.Период = СтруктураШапкиДокумента.Дата;
		тНоваяСтрока.Регистратор = СтруктураШапкиДокумента.Ссылка;
		тНоваяСтрока.Активность  = Истина;
		тНоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
		тНоваяСтрока.СчетУчета = СтрокаТЧ.СчетУчетаМСФО; //43
		тНоваяСтрока.Количество = СтрокаТЧ.Количество*?(СтруктураШапкиДокумента.ВидОперации = Перечисления.ПРГВидыОперацийПереходящихОтгрузок.ОтгрузкаБезПереходаПраваСобственности,-1,1);
		тНоваяСтрока.Стоимость = СтрокаТЧ.Количество*СтрокаТЧ.СебестоимостьПоПартиям*?(СтруктураШапкиДокумента.ВидОперации = Перечисления.ПРГВидыОперацийПереходящихОтгрузок.ОтгрузкаБезПереходаПраваСобственности,-1,1);
		тНоваяСтрока.КорСчет = СтрокаТЧ.СчетРасходовМСФО; //90.02
		тНоваяСтрока.КорСубконто1 = СтрокаТЧ.НоменклатурнаяГруппа; 
		тНоваяСтрока.КорСубконто2 = Неопределено; 
		тНоваяСтрока.КодОперации = ?(ТипЗнч(СтрокаТЧ.ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровУслуг"),Перечисления.КодыОперацийПартииТоваров.Реализация,Перечисления.КодыОперацийПартииТоваров.ВозвратОтПокупателя); 
		тНоваяСтрока.СписаниеПартий = Истина; 
	    тНоваяСтрока.НоменклатурнаяГруппа = СтрокаТЧ.НоменклатурнаяГруппа;
		тНоваяСтрока.ДокументДвижения = СтрокаТЧ.ДокументПродажи;
		тНоваяСтрока.ДокументДвиженияПериод = СтрокаТЧ.Период;
		
		//>>310516 Степанов
		Если тНоваяСтрока.Стоимость<>0 тогда
			ОстатокСтоимости = тНоваяСтрока.Стоимость; 
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
			Строки = РезультатДляДвиженийСрССТ.НайтиСтроки(Отбор);
			Для Каждого Стр Из Строки Цикл
				Если Стр.УдельныйВес<>0 тогда
					тНоваяСтр = мТаблицаДвиженийСредСебестоимость.Добавить();	
					тНоваяСтр.Период = СтруктураШапкиДокумента.Дата;
					тНоваяСтр.Регистратор = СтруктураШапкиДокумента.Ссылка;
					тНоваяСтр.Активность  = Истина;
					тНоваяСтр.Номенклатура = СтрокаТЧ.Номенклатура;
					тНоваяСтр.СтатьяЗатрат = Стр.СтатьяЗатрат;
					тНоваяСтр.Сумма = тНоваяСтрока.Стоимость*Стр.УдельныйВес;	
					ОстатокСтоимости = ОстатокСтоимости - тНоваяСтр.Сумма;
				КонецЕсли;	
			КонецЦикла;
			Если ОстатокСтоимости<>0 тогда
				тНоваяСтр.Сумма = тНоваяСтр.Сумма + ОстатокСтоимости;
			КонецЕсли;	
		КонецЕсли;	
		//<<
		
	КонецЦикла; 
	
	//>>310516 Степанов слишком большие расхождения с партиями были по этому методу
	////////мТаблицаДвиженийСредСебестоимость
	//////Для каждого СтрокаТЧ Из Результат Цикл
	//////
	//////	тНоваяСтрока = мТаблицаДвиженийСредСебестоимость.Добавить();	
	//////	тНоваяСтрока.Период = СтруктураШапкиДокумента.Дата;
	//////	тНоваяСтрока.Регистратор = СтруктураШапкиДокумента.Ссылка;
	//////	тНоваяСтрока.Активность  = Истина;
	//////	тНоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
	//////	тНоваяСтрока.СтатьяЗатрат = СтрокаТЧ.СтатьяЗатрат;
	//////	тНоваяСтрока.Сумма = СтрокаТЧ.Количество*СтрокаТЧ.СебестоимостьПоРНСредСеб*?(СтруктураШапкиДокумента.ВидОперации = Перечисления.ПРГВидыОперацийПереходящихОтгрузок.ОтгрузкаБезПереходаПраваСобственности,-1,1);	
	//////
	//////КонецЦикла;
	//<<
	
	//мТаблицаДвиженийКорректировкиПродаж
	Для каждого СтрокаТЧ Из РезультатДляДвиженийПартии Цикл
	
		тНоваяСтрока = мТаблицаДвиженийКорректировкиПродаж.Добавить();	
		тНоваяСтрока.Период = СтруктураШапкиДокумента.Дата;
		тНоваяСтрока.Регистратор = СтруктураШапкиДокумента.Ссылка;
		тНоваяСтрока.Активность  = Истина;
		тНоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
		тНоваяСтрока.ЗаказПокупателя = СтрокаТЧ.ЗаказПокупателя;
		тНоваяСтрока.ДоговорКонтрагента = СтрокаТЧ.ДоговорКонтрагента;
		тНоваяСтрока.ДокументПродажи = СтрокаТЧ.ДокументПродажи;
		тНоваяСтрока.ПРГАдресПоставки = СтрокаТЧ.ПРГАдресПоставки;
		тНоваяСтрока.Контрагент = СтрокаТЧ.Контрагент;
		тНоваяСтрока.НоменклатурнаяГруппа = СтрокаТЧ.НоменклатурнаяГруппа;
		тНоваяСтрока.СтавкаНДС = СтрокаТЧ.СтавкаНДС;
        тНоваяСтрока.СчетДт = СтрокаТЧ.СчетУчетаРасчетовСКонтрагентомМСФО;
        тНоваяСтрока.СчетКт = СтрокаТЧ.СчетДоходовМСФО;
		
		тНоваяСтрока.Количество = СтрокаТЧ.Количество*?(СтруктураШапкиДокумента.ВидОперации = Перечисления.ПРГВидыОперацийПереходящихОтгрузок.ОтгрузкаБезПереходаПраваСобственности,-1,1);
		тНоваяСтрока.Стоимость = СтрокаТЧ.СуммаВзаиморасчетов*?(СтруктураШапкиДокумента.ВидОперации = Перечисления.ПРГВидыОперацийПереходящихОтгрузок.ОтгрузкаБезПереходаПраваСобственности,-1,1);
		//{20.02.2017 Островерхий заявка №57373
		//тНоваяСтрока.СтоимостьБезСкидок = тНоваяСтрока.Стоимость;
		тНоваяСтрока.СтоимостьБезСкидок = тНоваяСтрока.СтоимостьБезСкидок;
		тНоваяСтрока.СтоимостьБезДопСкидки = тНоваяСтрока.СтоимостьБезДопСкидки;
		//20.02.2017 Островерхий} 
		тНоваяСтрока.НДС = СтрокаТЧ.СуммаНДС*?(СтруктураШапкиДокумента.ВидОперации = Перечисления.ПРГВидыОперацийПереходящихОтгрузок.ОтгрузкаБезПереходаПраваСобственности,-1,1);
		
	КонецЦикла;
	
КонецПроцедуры
